In [85]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
plt.style.use('seaborn-whitegrid')
%matplotlib inline

In [6]:
student={
        'name':['a','b','c','d','e'],
        'math':[45,43,56,67,87],
        'chemistry':[24,44,66,67,17],
        'physics':[45,43,56,67,87],
        'sex':['male','male','female','male','male']
    }

In [8]:
df=pd.DataFrame(student)

In [9]:
df

  name  math  chemistry  physics     sex
0    a    45         24       45    male
1    b    43         44       43    male
2    c    56         66       56  female
3    d    67         67       67    male
4    e    87         17       87    male

In [10]:
df[1:3]

  name  math  chemistry  physics     sex
1    b    43         44       43    male
2    c    56         66       56  female

In [17]:
df[['name','sex']][:3]

  name     sex
0    a    male
1    b    male
2    c  female

In [35]:
df1=pd.DataFrame(np.random.randint(1,100,20).reshape(5,4),
                 columns=list("ABCD"),
                 index=pd.date_range("20190620",periods=5))

In [36]:
df1

             A   B   C   D
2019-06-20  38  73  25  75
2019-06-21  30  69  21  82
2019-06-22  69  65  81   7
2019-06-23  35  35  58  85
2019-06-24  88  65  80  40

In [37]:
#df1['E']=np.array([1,2,3,4,5])

In [41]:
df1['E']=np.random.randint(2,70,5)

In [43]:
df1

             A   B   C   D   E
2019-06-20  38  73  25  75  21
2019-06-21  30  69  21  82  24
2019-06-22  69  65  81   7  69
2019-06-23  35  35  58  85  23
2019-06-24  88  65  80  40  53

In [46]:
df1.loc['2019-06-25']=[50,87,60,76,56]
df1

                      A   B   C   D   E
2019-06-20 00:00:00  38  73  25  75  21
2019-06-21 00:00:00  30  69  21  82  24
2019-06-22 00:00:00  69  65  81   7  69
2019-06-23 00:00:00  35  35  58  85  23
2019-06-24 00:00:00  88  65  80  40  53
2019-06-25           50  87  60  76  56

In [25]:
df1.loc[:,::2]

             A   C
2019-06-20  63  52
2019-06-21  49  58
2019-06-22   6  71
2019-06-23  41  43
2019-06-24  98  44

In [27]:
df1.loc[::2,:]

             A   B   C   D
2019-06-20  63   2  52  81
2019-06-22   6  74  71  90
2019-06-24  98  62  44  58

In [28]:
df1.loc['2019-06-22']

A     6
B    74
C    71
D    90
Name: 2019-06-22 00:00:00, dtype: int32

In [31]:
df1.loc['2019-06-22',['A','B']]

A     6
B    74
Name: 2019-06-22 00:00:00, dtype: int32

In [71]:
n1=pd.DataFrame(
        {    'sid':[231,232,233,234,235],
            'name':['x','y','z','p','q'],
            'age':[18,16,32,45,36]

        }
)

In [72]:
n1

   sid name  age
0  231    x   18
1  232    y   16
2  233    z   32
3  234    p   45
4  235    q   36

In [73]:
n2=pd.DataFrame(
        {    'sid':[231,232,234,235,236,240],
            'player':['wk','bat','bowler','bat','bat','allrounder'],
            'performance':[5.7,6.3,7.0,8.0,3.6,7.2]

        }
)

In [74]:
n2

   sid      player  performance
0  231          wk          5.7
1  232         bat          6.3
2  234      bowler          7.0
3  235         bat          8.0
4  236         bat          3.6
5  240  allrounder          7.2

In [80]:
n3=pd.DataFrame(
        {    'id':[231,235,233,240],
            'pos':pd.Categorical(['central','golkeeper','defence','attacker'])
            
        }
)

In [81]:
n3

    id        pos
0  231    central
1  235  golkeeper
2  233    defence
3  240   attacker

In [82]:
x=pd.merge(n1,n2,on="sid")

In [83]:
x

   sid name  age  player  performance
0  231    x   18      wk          5.7
1  232    y   16     bat          6.3
2  234    p   45  bowler          7.0
3  235    q   36     bat          8.0

In [84]:
y=pd.merge(n1,n2,on="sid",how="left")  #left join  (how->right(right join))
y

   sid name  age  player  performance
0  231    x   18      wk          5.7
1  232    y   16     bat          6.3
2  233    z   32     NaN          NaN
3  234    p   45  bowler          7.0
4  235    q   36     bat          8.0